{
  "examples": [
    {
      "input": "DIMENSIONAL ANALYSIS AND PHYSICAL QUANTITIES\n(ELECTIVE PHYSICS FOR SENIOR HIGH SCHOOLS)\n\nWhen solving problems in physics, we must ensure that the units on both sides of an equation are the same. This is the principle of dimensional homogeneity. Let us explore this important concept.\n\nOBJECTIVES\nBy the end of this section, students should be able to:\n1. State the fundamental quantities and their units\n2. Express derived quantities in terms of fundamental quantities\n3. Use dimensional analysis to check equations\n\nFUNDAMENTAL QUANTITIES\nIn physics, all measurements can be expressed in terms of seven fundamental quantities:\n- Mass $(M)$\n- Length $(L)$\n- Time $(T)$\n- Temperature $(\\theta)$\n- Electric current $(I)$\n- Luminous intensity $(J)$\n- Amount of substance $(N)$\n\nFor most mechanical problems, we mainly use $M$, $L$, and $T$.\n\nWORKED EXAMPLE 1:\nExpress the dimensions of pressure $(P)$.\nSolution:\n• Pressure = Force/Area\n• Force has dimensions $[ML T^{-2}]$\n• Area has dimensions $[L^2]$\n• Therefore, $P = [ML T^{-2}]/[L^2] = [M L^{-1} T^{-2}]$\n\nEXERCISE\n1. Find the dimensions of:\n   a) Power\n   b) Energy\n   c) Acceleration\n\nUSING DIMENSIONAL ANALYSIS\nDimensional analysis helps us:\n1. Check if equations are correct\n2. Find relationships between physical quantities\n3. Convert between different unit systems\n\nRemember! The powers of $M$, $L$, and $T$ must be equal on both sides of any physics equation.",

      "output": {
        "question": "The force, $F$, acting on the wings of an aircraft moving through the air of velocity, $v$, and density, $\\rho$, is given by the equation $F = k\\rho^{a}v^{b}A$ where, $k$ is a dimensionless constant and $A$ is the surface area of the wings of the aircraft. Use dimensional analysis to determine the values of $a$ and $b$.",
        "observation": "Most candidates provided incorrect first steps for the solution by making the wrong substitution of dimension units of velocity, density and area.",
        "expected_responses": "EXPECTED RESPONSES:\nDetermination of values of $x$, $y$ and $z$\nFor $M$; $y = 1$\n$T$; $x = 2$\nFor $L$; $= 1$\n$= 1$\n$z = 1$"
      }
    },
    {
      "input": "STRAIN ENERGY IN ELASTIC MATERIALS\n(ELECTIVE PHYSICS FOR SENIOR HIGH SCHOOLS)\n\nIn elastic materials, when we apply a force to stretch or compress them, they store energy. This stored energy is called strain energy.\n\nKEY CONCEPTS:\n\n1. Strain Energy:\nWhen a force deforms an elastic material, work is done. This work is stored as potential energy in the material. This stored energy can be recovered when the deforming force is removed.\n\n2. Factors Affecting Strain Energy:\n- Original length of the material $(l)$\n- Cross-sectional area $(A)$\n- Extension or compression $(e)$\n- Young's modulus of the material $(Y)$\n\n3. Young's Modulus:\n- Measures the stiffness of a material\n- Defined as: $Y = \\frac{\\text{stress}}{\\text{strain}} = \\frac{F/A}{e/l}$\n\nWORKED EXAMPLE:\nCalculate the strain energy in a steel wire of length 2 m, cross-sectional area $1.0 \\times 10^{-6}$ m², when stretched by 0.1 mm.\nGiven: Young's modulus of steel = $2.0 \\times 10^{11}$ N/m²\n\nSolution:\nStrain energy = $\\frac{YAe^2}{2l}$\n\nPRACTICE QUESTIONS:\n1. Why does a stretched elastic band feel warm?\n2. Explain why springs in vehicles store energy during bumpy rides.",

      "output": {
        "question": "1. Define strain energy.\nWrite an expression for the energy stored, $E$, in a stretched wire of original length, $l$, cross-sectional area, $A$, extension, $e$, and Young's modulus, $Y$, of the material of the wire.",
        "observation": "In 2(a), most candidates accurately defined strain energy.\nA few of the candidates mistook strain energy for elastic constant.\nIn 2(b), some candidates rendered the expression as instead of.",
        "expected_responses": "The definition of strain energy is: The energy stored in a material as a result of a change in its shape, size, or dimension, or the potential energy stored in an object when it is deformed, stretched, or compressed by an applied force, or the work done on a material when a force is applied to change its shape, stretch it, or compress it. The expression for strain energy is given by: $( E = \\frac{Y A e^2}{2l} )$."
      }
    },
    {
      "input": "SATELLITES AND ORBITS\n(ELECTIVE PHYSICS FOR SENIOR HIGH SCHOOLS)\n\nSatellites are artificial objects launched into orbit for various purposes such as communication, weather monitoring, navigation, and research. Depending on their purpose, satellites are placed in different types of orbits. Two common types are geostationary and polar orbits.\n\n1. **Geostationary Satellites**:\n   - These satellites orbit the Earth at the equator with a period equal to the Earth's rotation (24 hours).\n   - As a result, they appear stationary relative to a fixed point on the Earth's surface.\n   - They are ideal for continuous monitoring of specific regions, such as for weather forecasting or communication services.\n\n2. **Polar Satellites**:\n   - These satellites move in an orbit that passes over the poles, allowing them to scan the entire Earth as the planet rotates beneath them.\n   - Their orbital period is shorter and does not match the Earth's rotation, so they do not stay over a fixed point.\n   - They are used for applications requiring global coverage, such as environmental and mapping observations.\n\nKEY CONCEPTS:\n- Orbital period: The time it takes for a satellite to complete one revolution around the Earth.\n- Equatorial orbit: An orbit directly above the Earth's equator.\n- Polar orbit: An orbit passing over the poles.\n\nPRACTICE QUESTIONS:\n1. Explain why geostationary satellites are not suitable for observing the poles.\n2. Compare the advantages of geostationary and polar satellites for weather monitoring.",
      "output": {
        "question": "State three differences between geostationary satellites and polar satellites.",
        "observation": "Many candidates were able to differentiate between geostationary and polar satellites correctly. Some candidates, however, could not give more than one difference.",
        "expected_responses": "EXPECTED RESPONSES:\n\\begin{tabular}{|l|l|}\n\\hline\n\\textbf{Geostationary Satellites} & \\textbf{Polar Satellites} \\\\ \\hline\nThe period of revolution matches the Earth's rotation (24 hours/1 day). & The period of revolution does not match the Earth's rotation (varies). \\\\ \\hline\nOrbits directly along the equator (latitude). & Travels from pole to pole in orbit (longitude). \\\\ \\hline\nAppears stationary above a fixed point on the Earth's surface. & Does not remain in the same position relative to the Earth. \\\\ \\hline\nProvides continuous coverage of specific regions or areas. & Provides global coverage. \\\\ \\hline\n\\end{tabular}"
      }
    },

    {
      "input": "KINETIC THEORY OF MATTER AND WAVE-PARTICLE DUALITY\n(ELECTIVE PHYSICS FOR SENIOR HIGH SCHOOLS)\n\nKinetic theory explains the behavior of particles in matter and is based on the following postulates:\n1. Matter is made up of tiny particles (atoms or molecules) in constant random motion.\n2. These particles collide elastically with each other and with the walls of their container.\n3. The kinetic energy of the particles is proportional to the absolute temperature of the system.\n\nLight exhibits a dual nature, behaving as both a wave and a particle, depending on the phenomenon being studied:\n- **Wave Nature**: Demonstrated by phenomena such as diffraction, interference, and polarization.\n- **Particle Nature**: Demonstrated by phenomena such as the photoelectric effect and Compton scattering.\n\nKEY CONCEPTS:\n1. Kinetic Theory:\n   - Diffusion: The movement of particles from a region of higher concentration to a region of lower concentration due to random motion.\n\n2. Wave-Particle Duality:\n   - Light as a Wave: Behaviors such as refraction and diffraction.\n   - Light as a Particle: Phenomena like the photoelectric effect and black body radiation.\n\nPRACTICE QUESTIONS:\n1. Define diffusion using the kinetic theory of matter.\n2. State one phenomenon that shows light behaves as a wave and one that shows it behaves as a particle.",
      "output": {
        "question": "1. Using the kinetic theory, explain the term.\n2. Name one phenomenon that demonstrates that light behaves as a:\n   - Wave\n   - Particle.",
        "observation": "In (a), some candidates defined kinetic theory and diffusion without touching on the specific terms. Many candidates acknowledged either the random motion or the collision between molecules of gases and the walls of their container but failed to state both occurrences to get the full mark.\nIn (b), many candidates were able to provide a satisfactory response to the question about the phenomena of light and were able to demonstrate this knowledge.",
        "expected_responses": "EXPECTED RESPONSES:\n(a) \\textbf{Diffusion of fluid molecules using kinetic theory:}\n\nThe process where fluid molecules move randomly and collide with neighboring molecules due to their possession of kinetic energy.\n\n(b) \\textbf{List of phenomena:}\n\\begin{enumerate}\n  \\item \\textbf{Wave:}\n  \\begin{itemize}\n    \\item Refraction\n    \\item Reflection\n    \\item Diffraction\n    \\item Interference\n    \\item Polarization\n  \\end{itemize}\n  \\item \\textbf{Particle:}\n  \\begin{itemize}\n    \\item Photoelectric effect\n    \\item Compton effect/scattering\n    \\item Thermionic effect\n    \\item Black body radiation\n  \\end{itemize}\n\\end{enumerate}"
      }
    },
    {
      "input": "SEMICONDUCTORS\n(ADVANCED PHYSICS FOR SENIOR HIGH SCHOOLS)\n\nSemiconductors are materials whose electrical conductivity lies between that of conductors and insulators. They are classified into two types:\n1. **Intrinsic Semiconductors**: Pure forms of semiconductor materials like silicon or germanium, having equal numbers of electrons and holes.\n2. **Extrinsic Semiconductors**: Doped semiconductors where impurities are added to enhance conductivity.\n   - **N-Type**: Doping with elements that provide extra electrons.\n   - **P-Type**: Doping with elements that create additional holes.\n\nApplications of semiconductors include rectifiers, transistors, and diodes. Rectifiers are used to convert AC to DC.\n\nKEY CONCEPTS:\n1. Difference Between Intrinsic and Extrinsic Semiconductors:\n   - Intrinsic: Pure, equal number of charge carriers, low conductivity.\n   - Extrinsic: Doped, unequal number of charge carriers, higher conductivity.\n\n2. Full-Wave Rectification:\n   - Utilizes a transformer and diodes in a bridge arrangement.\n   - Smoothing achieved using a capacitor to reduce voltage fluctuations.\n\nPRACTICE QUESTIONS:\n1. State one difference between an intrinsic and an extrinsic semiconductor.\n2. Draw a circuit diagram to illustrate full-wave smoothing rectification.",
      "output": {
        "question": "1. State one difference between an intrinsic and an extrinsic semiconductor.\n2. Draw a circuit diagram to illustrate full-wave smoothing rectification.",
        "observation": "Many candidates differentiated between intrinsic and extrinsic semiconductors correctly. Only a few candidates attempted part (b), and it was executed poorly. It is necessary to provide candidates with more assistance in this particular aspect of Physics.",
        "expected_responses": "EXPECTED RESPONSES:\n(a) \\textbf{Difference between intrinsic and extrinsic semiconductors:}\n\\begin{table}[]\n\\begin{tabular}{|l|l|}\n\\hline\n\\textbf{Intrinsic} & \\textbf{Extrinsic} \\\\ \\hline\nPure               & Contains impurities/doped \\\\ \\hline\nEqual number of charge carriers (holes and electrons) & Majority and minority charge carriers (unequal number) \\\\ \\hline\nLow electrical conductivity/high resistivity & High electrical conductivity/low resistivity \\\\ \\hline\nThermally generated charge carriers & Charge carriers result from doping \\\\ \\hline\n\\end{tabular}\n\\end{table}\n\n(b) \\textbf{Sketch of the circuit to show full-wave smoothing rectification:}\n\\begin{figure}[h]\n\\centering\n\\includegraphics[scale=0.5]{full_wave_rectification.png}\n\\caption{Full-Wave Smoothing Rectification Circuit}\n\\end{figure}\n\\textbf{Description:} \n- D1 and D2 are diodes in the rectifier circuit.\n- Capacitor \\(C\\) is used to smooth the output.\n- Transformer (\\(Tr\\)) supplies the AC input.\n- \\(R_L\\) is the load resistance.\n\\textbf{Notes:}\n\\begin{enumerate}\n  \\item Accept diode-bridge arrangement.\n  \\item Do not accept a DC source.\n  \\item Score zero for missing AC source.\n\\end{enumerate}"
      }
    },
    {
      "input": "FIBRE OPTICS\n(ADVANCED PHYSICS FOR SENIOR HIGH SCHOOLS)\n\nFibre optics is a technology used to transmit information in the form of light pulses through thin, flexible, transparent fibres made of high-quality glass or plastic. These fibres use the principle of total internal reflection to efficiently transmit data over long distances.\n\nAdvantages of fibre optics over copper cables in telecommunications include:\n1. Greater bandwidth for higher data transfer rates.\n2. Faster signal transmission.\n3. Longer transmission distances with minimal signal loss.\n4. High efficiency and low power consumption.\n5. High-quality signal transmission with reduced interference.\n6. Low resistance, leading to better performance.\n\nPRACTICE QUESTIONS:\n1. What is fibre optics?\n2. State two reasons why optical fibres are preferred over copper cables in the telecommunication industry.",
      "output": {
        "question": "1. What is fibre optics?\n2. State two reasons why optical fibres are preferred over copper cables in the telecommunication industry.",
        "observation": "Most candidates are well-informed and have a good understanding of the subject matter. They were knowledgeable about the differences between optical fibre and fibre optics. They were able to provide valid reasons why optical fibres are often preferred over copper cables in telecommunications.",
        "expected_responses": "EXPECTED RESPONSES:\n(a) \\textbf{Fibre optics:}\n\\begin{itemize}\n  \\item Technology that transmits information/data using pulses of light through thin transparent fibres made of high-quality glass or plastic.\n\\end{itemize}\n\n(b) \\textbf{Reasons for preferring optical fibres to copper cables:}\n\\begin{itemize}\n  \\item Greater bandwidth\n  \\item Faster signal transmission\n  \\item Ability to cover longer distances\n  \\item Greater efficiency\n  \\item High-quality transmission with reduced interference\n  \\item Low resistance\n\\end{itemize}"
      }
    }
  ]
}
